#!/bin/env python
# -*- coding: utf-8 -*-
# encoding=utf-8 vi:ts=4:sw=4:expandtab:ft=python
"""
/***************************************************************************
  *
  * Copyright (c) 2020 Baidu.com, Inc. All Rights Reserved
  * @file:  gen_predict_cpu.py
  * @date  2021/5/27 10:57 AM
  * @brief 
  *
  **************************************************************************/
"""
import paddlehub as hub

module = hub.Module(name="ernie_gen_poetry")
test_texts = ['昔年旅南服，始识王荆州。', '高名出汉阴，禅阁跨香岑。']
expect = [[
    '一见便倾盖，论交更绸缪。别来二十年，日月如奔流。人生会合难，俯仰成春秋。',
    '一见便倾盖，论交更绸缪。别来二十年，日月如奔流。人生会合难，况乃岁月遒。' +
    '君家富文史，我老无田畴。相逢不相识，各在天一陬。人生百年内，聚散如浮沤。况我与夫子，相逢',
    '一见便倾盖，论交更绸缪。别来二十年，日月如奔流。人生会合难，况乃岁月遒。' +
    '君家富文史，我老无田畴。相逢不相识，各在天一陬。人生百年内，聚散如浮沤。况我与君别，飘零',
    '一见便倾盖，论交更绸缪。别来二十年，日月如奔流。人生会合难，况乃岁月遒。' +
    '君家富文史，我老无田畴。相逢不相识，各在天一陬。人生百年内，聚散如浮沤。况复各异乡，各在',
    '一见便倾盖，论交更绸缪。别来二十年，日月如奔流。人生会合难，况乃岁月遒。' +
    '君家富文史，我老无田畴。相逢不相识，各在天一陬。人生百年内，聚散如浮沤。况复各异乡，风雨'
], [
    '地僻无尘到，山高见水深。钟声传远寺，塔影落前林。欲问西来意，庭前柏树林。',
    '地僻无尘到，山高见水深。钟声传远寺，塔影落前林。欲问西来意，庭前柏树阴。',
    '地僻无尘到，山高见水深。钟声传远寺，塔影落前林。欲问西来意，庭前有桂林。',
    '地僻无尘到，山高见水深。钟声传远寺，塔影落前林。欲问西来意，庭前柏正森。',
    '地僻无尘到，山高见水深。钟声传远寺，塔影落前林。欲问西来意，庭前有桂阴。'
]]
results = module.generate(texts=test_texts, use_gpu=False, beam_width=5)
assert expect == results
